I was testing the latest version `1.13.0`, I think I've found a bug that's forcing the instance to be replaced, what I'm doing:
1. Use the data source `scaleway_instance_image` to get the latest Debian image ID
2. Create a new instance using the Debian image ID
3. Run `terraform apply` to create the resources
3. Re-run `terraform apply` which shows me that the instance must be replaced because of a difference in the image ID which is prefixed by the zone name:

```console
  # scaleway_instance_server.testing must be replaced
-/+ resource "scaleway_instance_server" "testing" {
      - additional_volume_ids            = [] -> null
        disable_dynamic_ip               = false
        disable_public_ip                = false
        enable_dynamic_ip                = false
        enable_ipv6                      = true
      ~ id                               = "fr-par-1/45b38255-1819-459d-a0ee-930d30e00838" -> (known after apply)
      ~ image                            = "cc9188b3-3938-47d7-b091-c9ecad1fe507" -> "fr-par-1/cc9188b3-3938-47d7-b091-c9ecad1fe507" # forces replacement
        ip_id                            = "fr-par-1/6c96b185-72eb-4433-853f-d358e6ce57f3"
      ~ ipv6_address                     = "2001:bc8:47ac:272a::1" -> (known after apply)
      ~ ipv6_gateway                     = "2001:bc8:47ac:272a::" -> (known after apply)
      ~ ipv6_prefix_length               = 64 -> (known after apply)
        name                             = "dev-testing"
      + organization_id                  = (known after apply)
      + placement_group_policy_respected = (known after apply)
      ~ private_ip                       = "10.65.62.85" -> (known after apply)
      ~ public_ip                        = "51.158.64.43" -> (known after apply)
      ~ security_group_id                = "1561d0ea-686e-4b4f-9850-05ac077df41b" -> "fr-par-1/1561d0ea-686e-4b4f-9850-05ac077df41b"
        state                            = "started"
        tags                             = [
            "terraform",
            "ytdl",
            "ytdl-dev",
        ]
        type                             = "DEV1-S"
        zone                             = "fr-par-1"

      ~ root_volume {
          ~ delete_on_termination = true -> (known after apply)
          ~ size_in_gb            = 20 -> (known after apply)
          ~ volume_id             = "950fc1a0-e9e3-4372-8702-9ea6d4627a5f" -> (known after apply)
        }
    }
```
Also as you can see the `security_group_id` also is missing the zone name.